"""
6)Реализовать структуру данных «Товары». Она должна представлять собой список
кортежей. Каждый кортеж хранит информацию об отдельном товаре. В кортеже должно
быть два элемента — номер товара и словарь с параметрами
(характеристиками товара: название, цена, количество, единица измерения).
Структуру нужно сформировать программно, т.е. запрашивать все данные у
пользователя.
Пример готовой структуры:
[
(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]
Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый
ключ — характеристика товара, например название, а значение — список значений-
характеристик, например список названий товаров.
Пример:
{
“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]
}
"""
structure = []
key1 = 'название'
key2 = 'цена'
key3 = 'количество'
key4 = 'ед'
n = int(input('количество различных товаров: '))
for i in range(n):
    structure.append((i + 1, {key1: input(f'{key1} {i + 1}: '),
                              key2: input(f'{key2} {i + 1}: '),
                              key3: input(f'{key3} {i + 1}: '),
                              key4: input(f'{key4} {i + 1}: ')}))
list_name = []
list_price = []
list_count = []
list_measure = []
for i in range(n):
    list_name.append(structure[i][1][key1])
    list_price.append(structure[i][1][key2])
    list_count.append(structure[i][1][key3])
    list_measure.append(structure[i][1][key4])
print(f'{key1}: {list_name}')
print(f'{key2}: {list_price}')
print(f'{key3}: {list_count}')
print(f'{key4}: {list_measure}')
print()
result_dict = {key1: list_name, key2: list_price, key3: list_count,
               key4: list_measure}
print(result_dict)
